class Disorder:
    """Базовый класс болезни."""

    MENTAL_DISORDER = {Депрессия: 'Современный мир наполнен внешними социальными стимулами. 
    Соцсети и телевидение показывают нам, как нужно жить и что нужно иметь, чтобы быть счастливым. 
    “Купи самый широкий телевизор – и твоя семья будет счастлива!”; “Слетай на Мальдивы и твоя жизнь изменится навсегда!” Мы опираемся на эти стимулы, гонимся за ними, и когда реализовываем, оказывается, что внутренне они нас не наполняют. Человек покупает широкий телевизор, летит на Мальдивы, а на следующий день чувствует тоску и пустоту. Материальные ценности не заменяют межличностное общение, не дают внутренней свободы и не обогащают духовно.

Оставаясь один на один с этой экзистенциальной пустотой, миллионы людей погружаются в депрессию.

Внешние стимулы заставляют человека чувствовать недовольство собой и собственную неполноценность. Оставаясь один на один с этой экзистенциальной пустотой, миллионы людей погружаются в депрессию. Разумеется, чтобы запустить механизмы этого заболевания, недостаточно только внешних факторов – необходима еще и генетическая предрасположенность к расстройству. Однако оказывается, что динамичное стремление к материальному очень легко становится триггером для запуска этих механизмов.



Шизофрения
Основная причина развития шизофрении – это генетическая предрасположенность и органические патологии. Широкое распространение этого заболевания связывают с несколькими факторами. Во-первых, за последние десятилетия наука научилась эффективнее выявлять и диагностировать это расстройство, а также отличать его симптомы от проявлений других заболеваний.

Читайте также

Психическая норма и патология  
Во-вторых, о шизофрении появляется все больше и больше информации, и из-за этого людям проще обращаться за помощью к специалистам или приводить на лечение своих близких. В-третьих, есть версия, что на развитие симптомов шизофрении влияют экологические факторы, например, загрязненность воздуха – отсюда увеличение больных в крупных городах. В России шизофрения распространена не более, чем в СССР, так как во многих случаях этот диагноз ставят ошибочно, путая с другими заболеваниями.



Тревожное расстройство

Это одно из самых распространенных психических расстройств. Причины такой популярности схожи с причинами роста распространенности депрессии. Люди стремятся к достижениям и ценностям, которые внутренне их не наполняют, и в конце концов их психика сдается перед этой гонкой. Человек старается успеть как можно больше за меньшее время, боится упустить возможности и это развивает в нем сильную тревогу. В маленьких городах распространенность тревожного расстройства не так высока. Это может быть связано с тем, что в регионах темп жизни не такой быстрый, как в центре, там подобные заболевания проявляются реже. Также люди в небольших городах редко обращаются за помощью – они часто предпочитают решать проблемы с тревожностью при помощи алкоголя или наркотиков.

У кого-то жизнь в высоком ритме может спровоцировать развитие панических атак, а у кого-то – генерализированное тревожное расстройство.

В проявлении этого заболевания также важна генетическая предрасположенность, и она может быть разной. У кого-то жизнь в высоком ритме может спровоцировать развитие панических атак, а у кого-то – генерализированное тревожное расстройство. Среда, в которой человек вырос, тоже играет немаловажную роль. Например, если ребенок вырос в семье, где родители паниковали по любому поводу и устраивали истерики, это может усугубить развитие тревожного расстройства во взрослом возрасте.



Биполярное расстройство

Биполярное расстройство не так распространено, как остальные заболевания, но о нем часто рассказывают и говорят в СМИ и массовой культуре. Это расстройство, как и шизофрения, имеет очень яркие и интересные обывателю симптомы: человек попеременно пребывает в маниакальном и в депрессивном состояниях, находясь в их крайних точках. Основная причина развития биполярного расстройства – это генетическая предрасположенность к заболеванию и органические патологии. Это расстройство тоже стали тщательнее диагностировать в последние десятилетия, о нем стало появляться все больше и больше информации как в научной среде, так и в средствах массовой информации. Возможно поэтому специалисты стали выявлять это расстройство чаще, а пациенты стали больше обращаться за помощью.

Читайте также

Что такое депрессия?  
Посттравматическое стрессовое расстройство

Распространенность посттравматического стрессового расстройства во многом зависит о страны и общества. В некоторых странах люди привыкли сами себя лечить или выбирать иные способы решения проблем с психикой. У многих в сознании просто отсутствует возможность пойти к врачу с подобной проблемой – они машут на это рукой или ищут помощи у гадалок и в церкви. Но лечение ПТСР – это совсем несложный процесс, и информация об этом постепенно распространяется.

Люди, которые живут с травматическими воспоминаниями десятилетиями и страдают от флешбеков, могут избавиться от симптомов расстройства всего за несколько сеансов психотерапии. Это заставляет многих обращаться за помощью, поэтому диагностируют ПТСР все чаще и чаще.



Обсессивно-компульсивное расстройство

Симптомы этого расстройства нельзя замаскировать с помощью самолечения, поэтому люди часто обращаются с ним к специалистам. ОКР получило большую распространенность из-за огромного количества появившихся триггеров, которые могут его “включать”. Конечно, здесь тоже важную роль играет генетическая предрасположенность, но внешние факторы провоцируют появление и усугубление симптомов. Взять хотя бы разнообразие моющих средство, которое появилось за последнее время. Для людей, которые тревожатся из-за бактерий, это становится серьезным стрессогенным фактором.

Повсеместное ношение масок, использование антисептиков и перчаток выявило огромное количество людей, которые были предрасположены к обсессивно-компульсивному расстройству.

Еще один триггер современного мира для людей, страдающих обсессивно-компульсивным расстройством – это электроприборы. Чем больше их страновится в доме, да и вообще вокруг, тем сильнее человек с ОКР тревожится об их включении и выключении. Если говорить про последний год, то на таких людей сильно повлияла пандемия и ограничения, связанные с коронавирусом. Повсеместное ношение масок, использование антисептиков и перчаток выявило огромное количество людей, которые были предрасположены к обсессивно-компульсивному расстройству.}

    def get_disorder(self) -> float:
        """Получить вердикт своего психического расстройства."""
        disorder = 
        return disorder
